Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/svd/PIC32CX5109BZ31032.svd
            <register>
               <name>SPLLCON</name>
               <description>SPLL CONTROL REGISTER</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0xC0010028</resetValue>
               <fields>
                  <field>
                     <name>SPLLPWDN</name>
                     <description>PLL Power Down Register bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SPLLPWDNSelect</name>
                        <enumeratedValue>
                           <name>PLL_OFF</name>
                           <description>PLL is powered down</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLL_ON</name>
                           <description>PLL is active</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPLLFLOCK</name>
                     <description>System PLL Force Lock</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SPLLFLOCKSelect</name>
                        <enumeratedValue>
                           <name>ASSERT</name>
                           <description>Force the SPLL lock signal to be asserted</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_ASSERT</name>
                           <description>Do not force the SPLL lock signal to be asserted</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPLLRST</name>
                     <description>System PLL Reset</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SPLLRSTSelect</name>
                        <enumeratedValue>
                           <name>ASSERT</name>
                           <description>Assert the reset to the SPLL</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_ASSERT</name>
                           <description>De-assert the reset to the SPLL</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPLLPOSTDIV1</name>
                     <description>SPLL Clock 1 Divide Value, 1 to 255</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SPLLPOSTDIV2</name>
                     <description>SPLL Clock 2 Divide Value, 1 to 15</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>SPLLPOSTDIV2Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disable</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_1</name>
                           <description>Second post divide by 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_2</name>
                           <description>Second post divide by 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_3</name>
                           <description>Second post divide by 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_4</name>
                           <description>Second post divide by 4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_5</name>
                           <description>Second post divide by 5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_6</name>
                           <description>Second post divide by 6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_7</name>
                           <description>Second post divide by 7</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_8</name>
                           <description>Second post divide by 8</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_9</name>
                           <description>Second post divide by 9</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_10</name>
                           <description>Second post divide by 10</description>
                           <value>0xa</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_11</name>
                           <description>Second post divide by 11</description>
                           <value>0xb</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_12</name>
                           <description>Second post divide by 12</description>
                           <value>0xc</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_13</name>
                           <description>Second post divide by 13</description>
                           <value>0xd</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_14</name>
                           <description>Second post divide by 14</description>
                           <value>0xe</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_15</name>
                           <description>Second post divide by 15</description>
                           <value>0xf</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPLL_BYP</name>
                     <description>SPLL Clock 2 Source</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SPLL_BYPSelect</name>
                        <enumeratedValue>
                           <name>SPLL3</name>
                           <description>SPLL3 (RFPLL) Clock is the clock source for ADC CP Clock Generation.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FRC</name>
                           <description>FRC is used as clock source for ADC CP Clock Generation.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POSC</name>
                           <description>POSC is used as clock source for ADC CP Clock Generation.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPLLCONCLR</name>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SPLLCONSET</name>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>SPLLCONINV</name>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>REFO1CON</name>
               <description>REFERENCE OSCILLATOR 1 CONTROL REGISTER</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>ROSEL</name>
                     <description>Reference Clock Source Select bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>ROSELSelect</name>
                        <enumeratedValue>
                           <name>REFCLKI</name>
                           <description>REFI Pin</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSCLK</name>
                           <description>System clock (reference clock reflects any device clock switching)</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PBCLK1</name>
                           <description>Peripheral clock 1 (reference clock reflects any peripheral clock switching)</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPLL3</name>
                           <description>System PLL3 (Clock-3)</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPRC</name>
                           <description>LPRC</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SOSC</name>
                           <description>SOSC</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POSC</name>
                           <description>POSC</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPLL1</name>
                           <description>System PLL1 (Clock-1)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FRC</name>
                           <description>FRC</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACTIVE</name>
                     <description>Reference Clock Request Status bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ACTIVESelect</name>
                        <enumeratedValue>
                           <name>ACTIVE</name>
                           <description>Reference clock request is active (User should not update this REFOCON register)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_ACTIVE</name>
                           <description>Reference clock request is not active (User can update this REFOCON register)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIVSWEN</name>
                     <description>Clock RODIV/ROTRIM switch enabled.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DIVSWENSelect</name>
                        <enumeratedValue>
                           <name>SWINPROGRESS</name>
                           <description>Clock Divider Switching currently in progress.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWCOMPLETE</name>
                           <description>Clock Divider Switch has completed.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RSLP</name>
                     <description>Reference Oscillator Run in Sleep bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RSLPSelect</name>
                        <enumeratedValue>
                           <name>RSLP</name>
                           <description>Reference Oscillator output continues to run in Sleep</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_RSLP</name>
                           <description>Reference Oscillator output is disabled in Sleep</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OE</name>
                     <description>Reference Clock Output Enable bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>OESelect</name>
                        <enumeratedValue>
                           <name>REFO1_OE</name>
                           <description>Reference clock is driven out on REFO1 pin</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_REFO1_OE</name>
                           <description>Reference clock is not driven out on REFO1 pin.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIDL</name>
                     <description>Peripheral Stop in Idle Mode bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SIDLSelect</name>
                        <enumeratedValue>
                           <name>SIDL</name>
                           <description>Discontinue module operation when device enters Idle mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_SIDL</name>
                           <description>Continue module operation in Idle mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FRZ</name>
                     <description>Freeze in Debug mode bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FRZSelect</name>
                        <enumeratedValue>
                           <name>FRZ</name>
                           <description>When emulator is in Debug mode, module freezes operation</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_FRZ</name>
                           <description>When emulator is in Debug mode, module continues operation</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ON</name>
                     <description>Output Enable bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ONSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Reference Oscillator Module enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Reference Oscillator Module disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RODIV</name>
                     <description>Reference Clock Divider bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>15</bitWidth>
                     <enumeratedValues>
                        <name>RODIVSelect</name>
                        <enumeratedValue>
                           <name>65K</name>
                           <description>REFO1 clock is Base clock frequency divided by 65,534 (32,767 *2)</description>
                           <value>0x7fff</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>REFO1 clock is Base clock frequency divided by 4 (2*2)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>REFO1 clock is Base clock frequency divided by 2 (1*2)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>REFO1 clock is same frequency as Base clock (no divider)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>REFO1CONCLR</name>
               <addressOffset>0x74</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>REFO1CONSET</name>
               <addressOffset>0x78</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>REFO1CONINV</name>
               <addressOffset>0x7C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>REFO1TRIM</name>
               <description>REFERENCE OSCILLATOR 1 TRIM REGISTER</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>ROTRIM</name>
                     <description>Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>9</bitWidth>
                     <enumeratedValues>
                        <name>ROTRIMSelect</name>
                        <enumeratedValue>
                           <name>ZERO</name>
                           <description>0/512 (0.0) divisor added to RODIV value</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONE</name>
                           <description>1/512 (0.001953125) divisor added to RODIV value</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO</name>
                           <description>2/512 (0.00390625) divisor added to RODIV value</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRIM_256</name>
                           <description>256/512 (0.5000) divisor added to RODIV value</description>
                           <value>0x100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRIM_512</name>
                           <description>511/512 (0.998046875) divisor added to RODIV value</description>
                           <value>0x1ff</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
